Revit 2016 API
GlobalParametersManager Methods
The GlobalParametersManager type exposes the following members.
Methods
Name | Description
AreGlobalParametersAllowed
 Tests whether global parameters are allowed in the given document.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
FindByName
 Finds whether a global parameter with the given name exists in the input document.
GetAllGlobalParameters
 Returns all global parameters available in the given document.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsUniqueName
 Tests whether a name is unique among existing global parameters of a given document.
IsValidGlobalParameter
 Tests whether an ElementId is of a global parameter in the given document.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
GlobalParametersManager Class
Autodesk.Revit.DB Namespace